export interface News {
  title: string;
  date: string;
  href: string;
  category: string;
  id: number;
}

export const homePageNews: News[] = [
  {
    title: "وزیر اطلاعات : باید اطلاعات کشور را جدی گرفت!",
    category: "سمات / اخبار و اطلاعیه ها",
    date: "۱۲ اردیبهشت ۱۴۰۲",
    href: "news/1",
    id: 1,
  },
  {
    title: "وزیر اطلاعات : باید اطلاعات کشور را جدی گرفت!",
    category: "سمات / اخبار و اطلاعیه ها",
    date: "۱۲ اردیبهشت ۱۴۰۲",
    href: "news/2",
    id: 2,
  },
  {
    title: "وزیر اطلاعات : باید اطلاعات کشور را جدی گرفت!",
    category: "سمات / اخبار و اطلاعیه ها",
    date: "۱۲ اردیبهشت ۱۴۰۲",
    href: "news/3",
    id: 3,
  },
  {
    title: "وزیر اطلاعات : باید اطلاعات کشور را جدی گرفت!",
    category: "سمات / اخبار و اطلاعیه ها",
    date: "۱۲ اردیبهشت ۱۴۰۲",
    href: "news/3",
    id: 4,
  },
  {
    title: "وزیر اطلاعات : باید اطلاعات کشور را جدی گرفت!",
    category: "سمات / اخبار و اطلاعیه ها",
    date: "۱۲ اردیبهشت ۱۴۰۲",
    href: "news/3",
    id: 5,
  },
  {
    title: "وزیر اطلاعات : باید اطلاعات کشور را جدی گرفت!",
    category: "سمات / اخبار و اطلاعیه ها",
    date: "۱۲ اردیبهشت ۱۴۰۲",
    href: "news/3",
    id: 6,
  },
  {
    title: "وزیر اطلاعات : باید اطلاعات کشور را جدی گرفت!",
    category: "سمات / اخبار و اطلاعیه ها",
    date: "۱۲ اردیبهشت ۱۴۰۲",
    href: "news/3",
    id: 7,
  },
  {
    title: "وزیر اطلاعات : باید اطلاعات کشور را جدی گرفت!",
    category: "سمات / اخبار و اطلاعیه ها",
    date: "۱۲ اردیبهشت ۱۴۰۲",
    href: "news/3",
    id: 8,
  },
];
